function [answer, iter, oi] = Coordinate(x0)
%метод покоординатного спуска
%для проверки в окрестности точки x0 = (1 1 1)^T получается ответ 
%     (-0.0000 0.1406   -0.6460)^T что является верным.

eps = 0.05; oi = 0;
x1 = x0;
f = @(x) x(1)^2 + 2*x(2)^2 + x(1)^2*x(2)^2 + 2*x(3) + exp(x(2)^2+x(3)^2) - x(2);
f1 = @(x) f([x x1(2) x1(3)]);
[x1(1), o] = fibon(f1);
oi = oi + o;
f2 = @(x) f([x1(1) x x1(3)]);
[x1(2), o] = fibon(f2);
oi = oi + o;
f3 = @(x) f([x1(1) x1(2) x]);
[x1(3), o] = fibon(f3);
oi = oi + o;
iter = 1;
while ((x1(1)-x0(1))^2 + (x1(2)-x0(2))^2 + (x1(3)-x0(3))^2 > eps)
    x0 = x1;
    f1 = @(x) f([x x0(2) x0(3)]);
    [x1(1), o] = fibon(f1);
    oi = oi + o;
    f2 = @(x) f([x1(1) x x0(3)]);
    [x1(2), o] = fibon(f2);
    oi = oi + o;
    f3 = @(x) f([x1(1) x1(2) x]);
    [x1(3), o] = fibon(f3);
    oi = oi + o;
    iter = iter + 1;
end
answer = x1;
%из (1,1,1) 2 многомерной и один одномерной. лучший результат, за который
%мы поплатились точностью вычислений
end
